Repository: hor63/openEVario
Catalog: po/*.po
Languages: de

source: {0}: String "{1}" does have less than 3 digits left of '.'. There is no space for degrees
de: {0}: String „{1}“ enthält weniger als 3 Ziffern links vom Dezimaltrenner '.'. Damit ist kein Platz für den Grad-Wert.

source: {0}: String "{1}" is not a valid NMEA timestamp string.
de: {0}: String „{1}“ ist kein gültiger NMEA Zeitstempel.

source: {0}: Sentence "{1}" failed. Reason: {2}
de: {0}: Nachricht „{1}“ ist fehlerhaft: {2}

source: {0}: Could not find a common sequence shared by at least 3 cycles. Go by individual cycle analysis.
de: {0}: Konnte keine identische Sequenz von Nachrichten innerhalb von 3 Zyklen finden. Wechsle zu individualler Analyse pro Zyklus.

source: {0}: Un-supported sentence type {1} from talker/type {2}/{3} is discarded.
de: {0}: Nachricht von nicht unterstütztem Nachrichtentyp {1} von Sender/Typ {2}/{3} wird verworfen.

source: {0} called for a processed GNSS record again! Sentence type = {1}
de: {0} wurde für einen bereits bearbeitete Nachricht aufgerufen! Nachrichtentyp ist {1}.

source: {0}: Invalid East-West indicator "{1}" in sentence "{2}"
de: {0}: Ungültiger Ost-West Anzeiger „{1}“ in Nachricht „{2}“.

source: {0}: Invalid North-South indicator "{1}" in sentence "{2}"
de: {0}: Ungültiger Nord-Süd Anzeiger „{1}“ in Nachricht „{2}“.

source: CRC error of driver instance "{0}". Stop processing.
de: CRC-Fehler in Treiberinstanz „{0}“. Weitere Verarbeitung wird angehalten.

source: {0}: Pressure = {1} mBar is outside the expected range!
de: {0}: Druck = {1} mBar ist außerhalb der Betriebsgrenze.

source: {0}: Driver instance {1} has a PROM CRC mismatch. CRC in the PROM is {2:#04X}; calculated CRC is {3:#04X}.
de: {0}: Treiberinstanz {1} hat einen PROM CRC Fehler. CRC im PROM ist {2:#04X}; berechneter CRC-Wert ist {3:#04X}.

source: Absolute atmospheric pressure sensors from TE Connectivity MEAS
de: TE Connectivity MEAS Sensoren für absoluten Atmosphärendruck
