Repository: hor63/openEVario
Catalog: po/*.po
Languages: de

source: Usage: openEVario [OPTION...] -c, --configuration=configFileName Name of the configuration file [{0}] -d, --debug Increase default logger level (Silent-[Error]-Info-Debug-Trace) -l, --logger-configuration=loggerConfigFile Name of logger configuration file [{1}] -q, -s, --quiet, --silent Shhhh. Be quiet. Suppress any logger output, i.e. set logger level to Silent (see -d) -?, --help Give this help list --usage Give a short usage message -V, --version Print program version Mandatory or optional arguments to long options are also mandatory or optional for any corresponding short options. Report bugs to https://github.com/hor63/openEVario/issues.
de: Verwendung: openEVario [OPTION...] -c, --configuration=configFileName Name der Konfigurationsdatei[{0}] -d, --debug Erhöht die Logger-Ebene (mehr Information) (Leise-Fehler-[Info]-Debug-Trace) -l, --logger-configuration=loggerConfigFile Name der Logger-Konfigurationsdatei [{1}] -q, -s, --quiet, --silent Pssst. Sei leise. Unterdrückt alle Loggerausgaben, d.h. Setze die Logger-Ebene zu “Leise”(see -d) -?, --help Gebe diesen Hilfetext aus. --usage Gebe einen kurzen Hinweis zur Verwendung aus. -V, --version Gebe die Programmversion aus. Argumente/Werte für Optionen in Langform gelten genauso für die korrespondierenden Optionen in Kurzform. Melden Sie Probleme und Fehler unter https://github.com/hor63/openEVario/issues.

source: Usage: openEVario [OPTION...] -c configFileName Name of the configuration file [{0}] -d Increase default logger level (Silent-[Error]-Info-Debug-Trace) -l loggerConfigFile Name of logger configuration file [{1}] -q, -s Shhhh. Be quiet. Suppress any logger output, i.e. set logger level to Silent (see -d) -? Give this help list -V Print program version Report bugs to https://github.com/hor63/openEVario/issues.
de: Verwendung: openEVario [OPTION...] -c configFileName Name der Konfigurationsdatei[{0}] -d Erhöht die Logger-Ebene (mehr Information) (Leise-Fehler-[Info]-Debug-Trace) -l, --logger-configuration=loggerConfigFile Name der Logger-Konfigurationsdatei [{1}] -q, -s, --quiet, --silent Pssst. Sei leise. Unterdrückt alle Loggerausgaben d.h. Setze die Logger-Ebene zu “Leise”(see -d) -? Gebe diesen Hilfetext aus. -V Gebe die Programmversion aus. Melden Sie Probleme und Fehler unter https://github.com/hor63/openEVario/issues.

source: Name of the configuration file [{0}]
de: Name der Konfigurationsdatei [{0}]

source: Name of logger configuration file [{0}]
de: Name der Logger-Konfigurationsdatei [{0}]

source: Increase default logger level (Silent-[Error]-Info-Debug-Trace)
de: Erhöht die Logger-Ebene (mehr Information); (Leise-Fehler-[Info]-Debug-Trace)

source: Shhhh. Be quiet. Suppress any logger output, i.e. set logger level to Silent
de: Pssst. Sei leise. Unterdrückt alle Loggerausgaben, d.h. setzt die Loggerebene auf „Leise“

source: Try "{0} --help" or "{1} --usage" for more information.
de: Versuche „{0} --help“ oder „{1} --usage“ um mehr Informationen zu erhalten.

source: {0}: getopt_long returned unexpected value {1}. Program aborting
de: {0}: getopt_long lieferte einen unerwarteten Code {1}. Programm wird abgebrochen

source: {0}, version {1} starting up.
de: {0}, Version {1} startet.

source: Error reading the configuration from file "{0}" is: {1}
de: Ein Fehler trat beim Lesen der Konfiguration aus Datei „{0}“ auf. Der Fehler ist: {1}

source: Property "terminateOnDriverLoadError" is not boolean. Use default value {0}
de: Parameter „terminateOnDriverLoadError“ ist kein Boolean-Typ. Standardwert {0} wird benutzt

source: Property "idlePredictionCycle" is not double or integer. Use default value {0}ms
de: Parameter „idlePredictionCycle“ ist weder vom Typ Double noch Integer. Standardwert {0}ms wird verwendet

source: Property "maxTimeBetweenPredictionAndMeasurementUpdate" is not double or integer. Use default value {0}ms
de: Parameter „maxTimeBetweenPredictionAndMeasurementUpdate“ ist weder vom Typ Double noch Integer. Standardwert {0}ms wird verwendet

source: {0}: currentStatus->getStatusVector_x()({1}) is not initialized.
de: {0}: currentStatus->getStatusVector_x()({1}) ist nicht initialisiert.

source: {0}: currentStatus->getErrorCovariance_P().coeffRef({1},{2}) is not initialized.
de: {0}: currentStatus->getErrorCovariance_P().coeffRef({1},{2}) ist nicht initialisiert.

source: {0}: urrentStatus->getSystemNoiseCovariance_Q().coeffRef({1},{2}) is not initialized.
de: {0}: urrentStatus->getSystemNoiseCovariance_Q().coeffRef({1},{2}) ist nicht initialisiert.

source: Adding new driver "{0}": {1}
de: Füge neuen Treiber „{0}“ hinzu. Beschreibung: {1}

source: Error searching mandatory configuration parameter "{0}": {1}
de: Fehler beim Suchen nach obligatorischen Parameter „{0}“: {1}

source: Configuration does not contain mandatory parameter "{0}"
de: Der obligatorische Parameter „{0}“ fehlt in der Konfiguration

source: List of dynamically loaded driver libraries : {0}
de: Liste der dynamisch geladenen Treiberbiblotheken: {0}

source: Configuration variable "{0}" is neither a string nor a string list
de: Konfigurationparameter „{0}“ ist weder ein String noch eine Stringliste.

source: Failed to create device "{0}" because: {1}
de: Gerät „{0}“ kann nicht erzeugt werden wegen: {1}

source: Program will be terminated.
de: Programm wird beendet.

source: Bye bye!
de: Tschüß!

source: Deleting device "{0}" from the device list
de: Lösche Gerät „{0}“ von der Geräteliste.

source: Loading driver library "{0}"
de: Lade Treiberbibliothek „{0}“

source: No error information available
de: Keine Informationen für den Fehler verfügbar

source: Error loading shared library "{0}": {1}
de: Fehler beim Laden der dynmischen Bibliothek „{0}“ ist: {1}

source: Error loading symbol "{0}" from shared library library "{1}": {2}
de: Fehler beim Laden von Symbol „{0}“ aus Bibliothek „{1}“ ist: {2}

source: Library "{0}" returned NULL for the library object.
de: Bibliothek „{0}“ lieferte NULL für das Bibliotheksobjekt.

source: Obtained library object "{0}": {1}
de: Bekam Bibliotheksobjekt „{0}“: {1}

source: Loading driver instance "{0}"
de: Lade Treiberinstanz „{0}“

source: Could not find property for driver instance "{0}"
de: Kann Parametersatz für Treiberinstanz „{0}“ nicht finden.

source: Property for driver instance "{0}" is not a structure
de: Parameter für Treiberinstanz „{0}“ ist keine Struktur.

source: Could not find property "{0}" within structure "{1}".
de: Kann Parameter „{0}“ in der Struktur „{1}“ nicht finden

source: Driver of driver instance {0} is {1}
de: Treiber für Instanz „{0}“ ist „{1}“.

source: Driver "{0}" for instance {1} does not exist.
de: Treiber „{0}“ für Treiberinstanz „{1}“ existiert nicht.

source: Instance {0} of driver "{1}" could not be created.
de: Kann Instanz „{0}“ für Treiber „{1}“ nicht erzeugen.

source: Created driver instance "{0}" for driver "{1}" from library "{2}"
de: Erzeute Treiberinstanz „{0}“ für Treiber „{1}“ aus Bibliothek „{2}“.

source: Driver instance "{0}" implements the idle loop. Another driver implements the idle loop too.
de: Treiberinstanz „{0}“ implementiert die Idle-Scheife. Ein andere Treiberinstanz implmentiert diese Schleife bereits.

source: Failed to initialize device "{0}" because: {1}
de: Gerät „{0}“ kann nicht initialisiert werden wegen: {1}

source: No valid I/O port for driver instance "{0}". The driver is not operable
de: Kein gültiger I/O Port existiert für Treiberinstanz „{0}“. Der Treiber ist nicht betriebsbereit.

source: Error in the main loop of driver instance "{0}": {1}
de: Fehler in der Hauptschleife von Treiberinstanz „{0}“: {1}

source: Driver instance "{0}" terminates due to shutdown command.
de: Treiberinstanz "{0}" wird beendet, weil Shutdown empfangen wurde.

source: Driver instance "{0}" terminates because maximum number of successive error was exceeded.
de: Treiberinstanz "{0}" wird beendet, weil die Anyahl maximaler aufeinanderfolgender Fehler überschritten wurde.

source: Uncaught exception in driver/instance "{0}"/"{1}". Message = {2}
de: Nicht gefangene Exception in Treiber/Instanz „{0}“/„{1}“. Fehlermeldung = {2}

source: Uncaught exception from unknown class/type in driver/instance "{0}"/"{1}"
de: Nicht gefangene Exception unbekannten Typs in Treiber/Instanz „{0}“/„{1}“

source: Cannot open calibration update file "{0}" for driver instance "{1}". Error: {2}
de: Kann Datei mit aktualisierten Kalibierdaten „{0}“ für Treiberinstanz „{1}“ nicht öffnen. Fehler ist: {2}

source: Error in {0} for driver instance "{1}". Error = {2}
de: Fehler in {0} für Treiberinstanz „{1}“. Fehler = {2}

source: Disable further calibration data updates.
de: Deaktiviere weitere Aktualisierungen der Kalibrierdaten.

source: Error in {0} for driver instance {1}. Unknown exception.
de: Fehler in {0} für Treiberinstanz {1}. Unbekannter Exceptiontyp

source: Cannot apply calibration data from file "{0}" to device "{1}".Driver "{2}" does not implement reading of calibration data.
de: Kann Kalibrierdaten aus Datei „{0}“ nicht für Treiberinstanz „{1}“ anwenden. Treiber „{2}“ implementiert implement nicht das Lesen von Kalibrierdaten.

source: Cannot read calibration data from device "{0}" for writing to update calibration data file "{1}". Driver "{2}" does not implement reading of calibration data.
de: Kann keine Kalibierdaten aus Treiberinstanz „{0}“ auslesen, um sie in Kalibierdatendatei „{1}“ zu schreiben. Treiber „{2}“ implementiert nicht das Lesen von Kalibrierdaten oder hat gar keine.

source: Read from calibration data file "{0}"
de: Lese aus Kalibrierdatendatei „{0}“

source: Cannot read calibration data from file "{0}". Trying alternative {1}
de: Kann keine Kalibrierdaten aus Datei „{0}“ lesen. Versuche Alternative Datei {1}.

source: Read from alternative calibration data file "{0}"
de: Lese von alternativer Kalibrierdatendatei „{0}“

source: Device instance "{0}": Error reading calibration data from file "{1}": {2}
de: Treiberinstanz „{0}“: Fehler bein Lesen der Kalibierdaten aus Datei „{1}“ ist: {2}

source: Device instance "{0}": Using builtin default calibration data
de: Treiberinstanz „{0}“: Benutze eingebaute Standard-Kalibierdaten

source: Error reading configuration of device instance "{0}": {1}
de: Fehler beim Lesen der Konfiguration von Treiberinstanz „{0}“ ist: {1}

source: Common parameters of driver instance "{0}":
de: Allgemeine Parameter von Treiberinstanz „{0}“:

source: {0}: Could not obtain {1} valid measurements in a row for 20 seconds. Cannot initialize the Kalman filter state.
de: {0}: Ich konnte keine {0} gültigen Messwerte in einer Reihe innerhalb von 20 Sekunden empfangen. Ich kann den Kalman Fiter status nicht initialisieren.

source: Port type "{0}" is defined more than once
de: Porttyp „{0}“ wurde mehr als einmal definiert.

source: {0} with portName={1}, portType={2}
de: {0} mit Portname={1}, Porttyp={2}

source: Port "{0}" is defined more than once
de: Port „{0}“ wurde mehr als einmal definiert.

source: Loading port "{0}"
de: Lade Port „{0}“

source: Type "{0}" of port "{1}" does not exist.
de: Typ „{0}“ für Port „{1}“ existiert nicht.

source: Port "{0}" will not be created.
de: Kann Port „{0}“ nicht erzeugen.

source: Port "{0}" has no "type" property.
de: Port „{0}“ hat keinen „type“ Parameter.

source: Port configuration property "{0}" is not a structure.
de: Parameter für Port „{0}“ ist keine Struktur.

source: Port "{0}" was successfully created and configured.
de: Port „{0}“ wurde erfolgreich erzeugt und konfiguriert.

source: deviceName = "{0}".
de: Gerätename = „{0}“.

source: blocking = {0}
de: blockierend = {0}

source: Exception when configuring port "{0}" in source {1} at line {2}: {3}
de: Exception bei Konfiguration von Port „{0}“ in Quelldatei {1} in Zeile {2}: {3}

source: Exception when configuring port "{0}": {1}
de: Exception bei Konfiguration von Port „{0)“: {1}

source: Property "IOPorts" is not a structure. No I/O ports will be created.
de: Parameter „IOPorts“ ist keine Struktur. Es werden keine I/O Ports erzeugt.

source: Properties section "IOPorts" does not exist. No I/O ports will be created.
de: Konfigurationssektion „IOPorts“ existiert nicht. Es werden keine I/O Ports erzeugt.

source: {0}: Cannot find IO port "{1}"
de: {0}: Kann I/O Port „{1}“ nicht finden.

source: Port {0} of type {1} is open.
de: Port {0} von Typ {1} ist offen.

source: Port {0} of type {1}: Cannot open device "{2}"
de: Port {0} von Typ {1}: Kann Gerät „{2}“ nicht öffnen.

source: Port {0} of type {1}: Cannot open device "{2}". errno = {3}: {4}
de: Port {0} von Typ {1}: Kann Gerät „{2}“ nicht öffnen. errno = {3}: {4}

source: Port {0} of type {1}: Opened device "{2}"
de: Port {0} von Typ {1}: Öffnete Gerät „{2}“.

source: Port {0} of type {1}: Closed device "{2}"
de: Port {0} von Typ {1}: Gerät „{2}“ ist geschlossen.

source: I/O Port {0}: Error code {1} has been set {2} times. The status is being set to permanent error.
de: I/O Port {0}: Fehlercode {1} wurde {2} mal hintereinander gesetzt. Der Status auf auf "permanent gestört" gesetzt.

source: {0} called for I/O port {1}. Status is not OPEN but {2}.
de: Funktion {0} wurde für Port {1} aufgerufen. Der Portstatus ist aber nicht OPEN sondern {2}.

source: Port "{0}" of type "{1}": {4} error {2}: {3}
de: Port „{0}“ von Typ „{1}“: {4} Fehler {2}: {3}

source: Port "{0} of type "{1}": Buffer too small for the datagram. Buffer length = {2}, datagram length = {3}.
de: Port „{0} von Typ „{1}“: Puffer ist zu klein für das Datagramm. Pufferlänge = {2}, Datagramm Länge = {3}.

source: Error opening port "{0}". Cannot retrieve I2C capabilites of device {1}. errno = {2} : {3}
de: Error beim Öffnen von Port „{0}“. Kann I2C Fähigkeiten nicht auslesen. errno = {1} : {2}

source: {0}: {1} error for device {3} of port "{2}". errno = {4}: {5}
de: {0}: {1} Fehler für Gerät {3} von Port „{2}“. errno = {4}: {5}

source: {0}, port "{1}": Neither SMBus nor direct I2C is supported.
de: {0}, Port „{1}“: Weder SMBus noch direktes I2C werden unterstützt.

source: {0} for port "{1}": Why the hell do you want to send 0 (ZERO!) bytes to I2C device {2:#04X}
de: {0} für Port „{1}“: Warum zur Hölle willst Du 0 (Null!) Bytes an I2C device 0x{2:#04X} schicken?

source: {0}, port "{1}": Direct I2C is not supported.
de: {0}, Port „{1}“: Direktes I2C wird nicht unterstützt.

source: I2CPort::check10BitAddr: Error using 10-bit I2C address {0:#04X} is not supported for port "{1}"
de: I2CPort::check10BitAddr: Fehler, 10-Bit I2CAdresse {0:#04X} wird für Port „{1}“ nicht unterstützt.

source: Device {1} of port "{0}" is not a tty/serial line device
de: Gerät {1} von Port „{0}“ ist kein tty/serielles Gerät

source: Cannot retrieve tty attributes for port "{0}", device {1}. tcgetattr error = {2}: {3}
de: Kann tty Attribute von Port „{0}“, Gerät {1} nicht lesen. tcgetattr Fehler = {2}: {3}

source: Cannot set tty attributes for port "{0}", device {1}. tcsetattr error = {2}: {3}
de: Kann tty Attribute von Port „{0}“, Gerät {1} nicht schreiben. tcsetattr Fehler = {2}: {3}

source: Error configuring port "{0}": Baud rate "{1}" is not numeric
de: Fehler bei Konfiguration von Port „{0}“: Baudrate „{1}“ ist nicht numerisch.

source: Error configuring port "{0}": Number data bits "{1}" must be 7 or 8.
de: Fehler bei Konfiguration von Port „{0}“: Anzahl Datenbits „{1}“ muss 7 oder 8 sein.

source: Error configuring port "{0}": Number data bits "{1}" is not numeric
de: Fehler bei Konfiguration von Port „{0}“: Anzahl Datenbits „{1}“ ist nicht numerisch.

source: Error configuring port "{0}": Parity value "{1}" is invalid
de: Fehler bei Konfiguration von Port „{0}“: Parität „{1}“ ist ein ungültiger Wert.

source: Error configuring port "{0}": Number stop bits "{1}" must be 1 or 2.
de: Fehler bei Konfiguration von Port „{0}“: Anzahl Stopbits „{1}“ muss 1 oder 2 sein.

source: Error configuring port "{0}": Number stop bits "{1}" is not numeric
de: Fehler bei Konfiguration von Port „{0}“: Anzahl Datenbits „{1}“ ist nicht numerisch.

source: Error configuring port "{0}": Handshake "{1}" is invalid.
de: Fehler bei Konfiguration von Port „{0}“: Handshake „{1}“ ist ein ungültiger Wert.

source: Error configuring port "{0}": Speed value "{1}" is invalid.
de: Fehler bei Konfiguration von Port „{0}“: Schnittstellengeschwindigkeit „{1}“ ist ein ungültiger Wert.

source: Port {0} of type {1}: End of file condition upon read. Closing the port.
de: Port {0} of type {1}: „End of file“ (EOF) Bedingung trat beim Lesen auf. Schließe den Port.

source: Error configuring port "(0)" of type {1}: Mandatory property {3} is missing.
de: Fehler bei der Konfiguration von Port „(0)“ von Typ {1}: Pflichtparameter {3} fehlt.

source: {0}: Error resolving host "{1}" and/or TCP port "{2}" for I/O port "{3}". Error code = {4}: {5}
de: {0}: Fehler beim Auflösen von Hostadresse „{1}“ und/oder TCP port „{2}“ für I/O port „{3}“. Fehlercode = {4}: {5}

source: {0}: Error resolving host "{1}" and/or TCP port "{2}" for I/O port "{3}": getaddrinfo() returned 0 but *_pai is NULL.
de: {0}: Fehler beim Auflösen von Hostadresse „{1}“ und/oder TCP port „{2}“ für I/O port „{3}“: getaddrinfo() lieferte 0 aber *_pai ist NULL.

source: {0}: Error creating a {1} socket for port "{2}". errno = {3}: {4}
de: {0}: Fehler beim Erzeugen eines {1} Socket für I/O Port „{2}“. errno = {3}: {4}

source: {0}: Error connect TCP socket to host "{1}" on TCP port "{2}" for I/O port "{3}". errno = {4}: {5}
de: {0}: Fehler beim Verbinden eines TCP Sockets zu Host „{1}“ auf TCP port „{2}“ für I/O port „{3}“. errno = {4}: {5}

source: Port "{0}": Connected to host {1} on TCP port {2}.
de: Port „{0}“ ist mit Host {1} auf TCP port {2} verbunden.

source: Open I/O port "{0}": setsockopt {1} error: errno = {2} : {3}
de: Öffnen von I/O port „{0}“: setsockopt {1} Fehler: errno = {2} : {3}

source: Configuration error for port {0}: Both peer host and peer port must be defined or none.
de: Konfigurationsfehler für Port {0}: Entweder müssen beide Partneradresse und Portnummer definiert werden oder keine von beiden.

source: {0}: I/O port {1} error: neither a local nor a remote port and/or host address were defined.
de: {0}: Konfigurationsfehler von Port {1}: Weder ein lokaler noch ein Partner-Port und/oder -Adresse wurden definiert

source: {0}: Port {1}: getaddrinfo() error for local host {2}, local UDP port {3} = {4} : {5}
de: {0}: Port „{1}“: getaddrinfo() Fehler für lokale Hostadresse {2}, lokalen UDP Port {3} = {4} : {5}

source: {0}: Port {1}: bind() error for local host {2}, UDP port {3} = {4} : {5}
de: {0}: Port „{1}“: bind() Fehler für lokale Hostadresse {2}, lokalen UDP Port {3} = {4} : {5}

source: {0}: Port {1}: getaddrinfo() error for peer host {2}, UDP port {3} = {4} : {5}
de: {0}: Port „{1}“: getaddrinfo() Fehler für Zielhostadresse {2}, Ziel-UDP Port {3} = {4} : {5}

source: {0}: Port "{1}" opened successful
de: {0}: Port „{1}“ wurde erfolgreich geöffnet.

source: {0}: For I/O port {1} no peer port and/or address are defined. I do not know where to send data to. Closing the Port.
de: {0}: Für I/O Port {1} wurden keine Zieladresse und/oder Zielportnummer definiert. Ich weiß nicht, wo ich die Daten hinschicken soll. Ich schließe den Port.

source: {0}: for driver instance "{1}"
de: {0}:Lade Treiberinstanz „{1}“

source: Could not read property "{0}" for device instance "{1}" because: {2}
de: Kann Parameter „{0}“ für Treiberinstanz „{1}“ nicht lesen. Grund: {2}.

source: Driver instance "{0}" data:
de: Treiberinstanz „{0}“ Daten:

source: Calibration data file name = {0}
de: Name der Kalibrierdatendatei = „{0}“

source: Differential and gage pressure Amsys sensors AMS5915
de: Amsys AMS5915 Differenz- und Absolutdruck-Sensoren

source: Initialize the {0} driver library
de: Initialisiere die {0} Treiberbibliothek.

source: CRC error of received magnetometer trim data message
de: CRC Fehler in der Magnetometer Kalibrierdaten Nachricht.

source: CRC error of received acc/gyr/mag sensor data message
de: CRC Fehler in der acc/gyr/mag Sensordaten Nachricht

source: CRC error of received acc/gyr sensor data message
de: CRC Fehler in der acc/gyr Sensordaten Nachricht

source: Driver library for Bosch BMX IMUs on the horImuBoard sensor board
de: Treiberbibliothek für Bosch BMX IMUs

source: Template for a new driver library
de: Muster für eine neue Treiberbibliothek

source: Cannot open IGC file "{0}".
de: Kann IGC Datei „{0}“ nicht öffnen.

source: Opened IGC file "{0}".
de: IGC Datei „{0}“ ist offen.

source: Closed IGC file "{0}".
de: IGC Datei „{0}“ ist geschlossen.

source: Driver library for simulation and test drivers based on IGC file recordings
de: Treiberbibliothek für Tests und Simulationen basierend auf Aufzeichnungen aus IGC-Dateien

source: {0}: WHO AM I contains expected {1:#04X}.
de: {0}: WHO AM I ist der erwartete Wert {1:#04X}.

source: {0}: WHO AM I value is not {1:#04X}, but {2:#04X}. The device is obviously not a {3} sensor.
de: {0}: Der WHO AM I Wert ist nicht der erwartete {1:#04X}, sondern {2:#04X}. Das Gerät ist offenbar kein {3} Sensor.

source: Absolute atmospheric pressure sensors MPL3115
de: MPL3115 Sensoren für absoluten Atmosphärendruck

source: Driver library for TDK/Invensense MPU-9150 IMU
de: Treiberbibliothek für TDK/Invensense MPU-9150 IMUs

source: Property is a struct or a list.
de: Parameter ist eine Struktur oder eine Liste.

source: Value {0} is invalid. Valid values are 'A' or 'B'.
de: Wert {0} ist ungültig. Gültige Werte sind 'A' oder 'B'.

source: Both properties "{0}" and "{1}" are defined. Only one of these two is allowed.
de: Beide Parameter „{0}“ und „{1}“ wurden definiert. Nur einer der beiden Parameter ist erlaubt.

source: Neither configurations "{0}" and "{1}" are defined.
de: Keiner der beiden möglichen Parameter „{0}“ and „{1}“ wurden definiert

source: {0}: Read configuration property {1} for driver instance "{2}" failed: {3}
de: {0}: Fehler beim Lesen Lesen von Parameter {1} für Treiberinstanz „{2}“ ist: {3}

source: Absolute atmospheric pressure sensors MS4515
de: MS4515 Sensoren für absoluten Atmosphärendruck

source: {0}: Received unexpected sentence start. Discarding {1} bytes.
de: {0}: Empfing unerwarteten Start einer neuen Nachricht. Verwerfe {1} Bytes.

source: {0}: Too short sentence received, or CR character is missing. Discarding {1} bytes.
de: {0}: Empfing unvollständige Nachricht oder das CR fehlt. Verwerfe {1} Bytes.

source: {0}: Received illegal character {1:#04X}. Discarding current sentence with {2} bytes.
de: {0}: Empfing ungültiges Zeichen {1:#04X}. Verwerfe Nachricht mit {2} Bytes.

source: {0}: Current sentence buffer overflow (> {2} characters). Discard {1} bytes.
de: {0}: Überlauf des Nachrichtenpuffers (> {2} Zeichen). Verwerfe {1} Bytes.

source: {0}: Checksum in the sentence {1:#04X} is unequal to the calculated checksum {2:#04X}. Discard sentence.
de: {0}: Prüfsumme in der Nachricht {1:#04X} ist ungleich der berechneten Prüfsumme {2:#04X}. Verwerfe die Nachricht.

source: {0}: Checksum section contains non-numeric characters "{1}". Discard sentence.
de: {0}: Die Prüfsumme „{1}“ enthält nicht-numerische Zeichen. Verwerfe die Nachricht.

source: {0}: Number of fields in the sentence exceeds the maximum {1} fields. Discard sentence.
de: {0}: Anzahl der Felder überschreitet die maximale Anzahl {1}. Verwerfe die Nachricht.

source: NmeaGPS driver for satellite navigation devices emitting NMEA 0813 sentences on serial ports or Bluetooth
de: NmeaGPS Treiber für Empfänger von Navigationssatteliten, die NMEA 0813 produzieren.

source: NMEASet::strToD: String "{0}" is not a valid double value.
de: NMEASet::strToD: String „{0}“ ist kein gültiger double float-Wert.

source: {0}: String "{1}" does not contain a decimal separator '.'.
de: {0}: String „{1}“ enthält keinen Dezimaltrenner '.'.
